k6/results/volume-10000.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scripts/load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m10s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 06/30 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 06/30 VUs  01.0s/40.0s

running (0m02.0s), 12/30 VUs, 6 complete and 0 interrupted iterations
default   [   5% ] 12/30 VUs  02.0s/40.0s

running (0m03.0s), 18/30 VUs, 18 complete and 0 interrupted iterations
default   [   7% ] 18/30 VUs  03.0s/40.0s

running (0m04.0s), 24/30 VUs, 35 complete and 0 interrupted iterations
default   [  10% ] 24/30 VUs  04.0s/40.0s

running (0m05.0s), 29/30 VUs, 56 complete and 0 interrupted iterations
default   [  12% ] 29/30 VUs  05.0s/40.0s

running (0m06.0s), 30/30 VUs, 85 complete and 0 interrupted iterations
default   [  15% ] 30/30 VUs  06.0s/40.0s

running (0m07.0s), 30/30 VUs, 111 complete and 0 interrupted iterations
default   [  17% ] 30/30 VUs  07.0s/40.0s

running (0m08.0s), 30/30 VUs, 137 complete and 0 interrupted iterations
default   [  20% ] 30/30 VUs  08.0s/40.0s

running (0m09.0s), 30/30 VUs, 166 complete and 0 interrupted iterations
default   [  22% ] 30/30 VUs  09.0s/40.0s

running (0m10.0s), 30/30 VUs, 194 complete and 0 interrupted iterations
default   [  25% ] 30/30 VUs  10.0s/40.0s

running (0m11.0s), 30/30 VUs, 222 complete and 0 interrupted iterations
default   [  27% ] 30/30 VUs  11.0s/40.0s

running (0m12.0s), 30/30 VUs, 249 complete and 0 interrupted iterations
default   [  30% ] 30/30 VUs  12.0s/40.0s

running (0m13.0s), 30/30 VUs, 278 complete and 0 interrupted iterations
default   [  32% ] 30/30 VUs  13.0s/40.0s

running (0m14.0s), 30/30 VUs, 307 complete and 0 interrupted iterations
default   [  35% ] 30/30 VUs  14.0s/40.0s

running (0m15.0s), 30/30 VUs, 335 complete and 0 interrupted iterations
default   [  37% ] 30/30 VUs  15.0s/40.0s

running (0m16.0s), 30/30 VUs, 364 complete and 0 interrupted iterations
default   [  40% ] 30/30 VUs  16.0s/40.0s

running (0m17.0s), 30/30 VUs, 392 complete and 0 interrupted iterations
default   [  42% ] 30/30 VUs  17.0s/40.0s

running (0m18.0s), 30/30 VUs, 421 complete and 0 interrupted iterations
default   [  45% ] 30/30 VUs  18.0s/40.0s

running (0m19.0s), 30/30 VUs, 450 complete and 0 interrupted iterations
default   [  47% ] 30/30 VUs  19.0s/40.0s

running (0m20.0s), 30/30 VUs, 478 complete and 0 interrupted iterations
default   [  50% ] 30/30 VUs  20.0s/40.0s

running (0m21.0s), 30/30 VUs, 507 complete and 0 interrupted iterations
default   [  52% ] 30/30 VUs  21.0s/40.0s

running (0m22.0s), 30/30 VUs, 535 complete and 0 interrupted iterations
default   [  55% ] 30/30 VUs  22.0s/40.0s

running (0m23.0s), 30/30 VUs, 561 complete and 0 interrupted iterations
default   [  57% ] 30/30 VUs  23.0s/40.0s

running (0m24.0s), 30/30 VUs, 589 complete and 0 interrupted iterations
default   [  60% ] 30/30 VUs  24.0s/40.0s

running (0m25.0s), 30/30 VUs, 615 complete and 0 interrupted iterations
default   [  62% ] 30/30 VUs  25.0s/40.0s

running (0m26.0s), 30/30 VUs, 643 complete and 0 interrupted iterations
default   [  65% ] 30/30 VUs  26.0s/40.0s

running (0m27.0s), 30/30 VUs, 669 complete and 0 interrupted iterations
default   [  67% ] 30/30 VUs  27.0s/40.0s

running (0m28.0s), 30/30 VUs, 699 complete and 0 interrupted iterations
default   [  70% ] 30/30 VUs  28.0s/40.0s

running (0m29.0s), 30/30 VUs, 727 complete and 0 interrupted iterations
default   [  72% ] 30/30 VUs  29.0s/40.0s

running (0m30.0s), 30/30 VUs, 757 complete and 0 interrupted iterations
default   [  75% ] 30/30 VUs  30.0s/40.0s

running (0m31.0s), 30/30 VUs, 785 complete and 0 interrupted iterations
default   [  77% ] 30/30 VUs  31.0s/40.0s

running (0m32.0s), 30/30 VUs, 815 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  32.0s/40.0s

running (0m33.0s), 30/30 VUs, 841 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  33.0s/40.0s

running (0m34.0s), 30/30 VUs, 871 complete and 0 interrupted iterations
default   [  85% ] 30/30 VUs  34.0s/40.0s

running (0m35.0s), 30/30 VUs, 900 complete and 0 interrupted iterations
default   [  87% ] 30/30 VUs  35.0s/40.0s

running (0m36.0s), 27/30 VUs, 927 complete and 0 interrupted iterations
default   [  90% ] 27/30 VUs  36.0s/40.0s

running (0m37.0s), 21/30 VUs, 954 complete and 0 interrupted iterations
default   [  92% ] 21/30 VUs  37.0s/40.0s

running (0m38.0s), 16/30 VUs, 974 complete and 0 interrupted iterations
default   [  95% ] 16/30 VUs  38.0s/40.0s

running (0m39.0s), 09/30 VUs, 990 complete and 0 interrupted iterations
default   [  97% ] 09/30 VUs  39.0s/40.0s

running (0m40.0s), 03/30 VUs, 998 complete and 0 interrupted iterations
default   [ 100% ] 03/30 VUs  40.0s/40.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=110.42ms
    ✓ 'p(99)<1000' p(99)=206.25ms

    http_req_failed
    ✓ 'rate<0.1' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2002    49.259969/s
    checks_succeeded...: 100.00% 2002 out of 2002
    checks_failed......: 0.00%   0 out of 2002

    ✓ status is 200
    ✓ response time < 500ms

    HTTP
    http_req_duration..............: avg=64.71ms min=37.76ms med=55.92ms max=301.2ms p(90)=94.16ms p(95)=110.42ms
      { expected_response:true }...: avg=64.71ms min=37.76ms med=55.92ms max=301.2ms p(90)=94.16ms p(95)=110.42ms
    http_req_failed................: 0.00%  0 out of 1001
    http_reqs......................: 1001   24.629984/s

    EXECUTION
    iteration_duration.............: avg=1.06s   min=1.03s   med=1.05s   max=1.3s    p(90)=1.09s   p(95)=1.11s   
    iterations.....................: 1001   24.629984/s
    vus............................: 3      min=3         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 597 kB 15 kB/s
    data_sent......................: 131 kB 3.2 kB/s



running (0m40.6s), 00/30 VUs, 1001 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  40s